app/controllers/blogs_controller.rb

INSERT INTO "blogs" ("title", "body", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "New "], ["body", "Hello this is my first blog"], ["user_id", 1], ["created_at", "2024-05-30 15:26:57.599535"], ["updated_at", "2024-05-30 15:26:57.599535"]]
---
  def create
    @blog = current_user.blogs.new(blog_params)

    respond_to do |format|
      if @blog.save

SELECT "blogs".* FROM "blogs" WHERE "blogs"."user_id" = $1 AND "blogs"."id" = $2 LIMIT $3  [["user_id", 1], ["id", 1], ["LIMIT", 1]]
---
    def set_blog
      @blog = current_user.blogs.find(params[:id])

SELECT "blogs".* FROM "blogs" WHERE "blogs"."user_id" = $1 AND "blogs"."id" = $2 LIMIT $3  [["user_id", 1], ["id", 1], ["LIMIT", 1]]
---
  def import_batch(rows)
    ActiveRecord::Base.transaction do
      Blog.insert_all(rows.map { |row| row.merge(user_id: current_user.id) })